{
    "header": {
        "title_1": "Hi there,",
        "title_2": "I'm Vijay",
        "subtitle_1": "I'm React Engineer",
        "subtitle_2": "and a open source enthusiast",
        "job_title": "Senior FrontEnd Developer",
        "company": "Quantilope GmbH, 📍Hamburg,Germany"
    },
    "navbar": {
        "about_me": "About me",
        "projects": "Open Source Projects",
        "experience": "Work History"
    },
    "about_me": {
        "info_1": "I am an enthusiastic FrontEnd Developer, passionate about User interfaces and User experiences with deep interest in programming and building software products that solves problems 🤓",
        "info_3": "I have over <strong>6 years of experience</strong> in Front end development with good knowledge in",
        "info_4": "Constantly trying to improve my and my team's developer experience ⚒️.",
        "info_5": "Currently trying to contribute to VSCode",
        "skills": "Skills"
    },
    "and": "and",
    "experience": {
        "quantilope": {
            "company_name": "Quantilope GmbH, Hamburg,Germany",
            "role_1": "I play an integral role by developing cutting edge user interfaces for the future of  Consumer Anytime platform.",
            "role_2": "I work with a team of Backend and Front end developers who are experts in <b>Typescript , React and Node JS</b>.<br /> We as a team are responsible for Data Collection and Data Quality platform of Quantilope. Our mission as a team is to improve the market research platform by providing  cutting edge user interfaces that makes participating in surveys more playful",
            "role_3": "I am responsible for developing and maintaining the new <strong>Survey application</strong> which is state of the art . <br /> We are actively trying to beat our competitors such as <strong>Typeform , SurveyMonkey and PollFish</strong>. I work closely with designers and provide valuable feasbility feedback by judging the level of front end work that would be needed to develop the design into a usable software application",
            "achievement_1": "Laying out a Style System using SASS",
            "achievement_2": "Integration of <strong>Chromatic</strong> to acheive 100% visual testing",
            "achievement_3": "Component System that scales well with incoming product requirements",
            "achievement_4": "Built a <strong>VS code extension</strong> to improve the DX in the team"
        },
        "about_you": {
            "company_name": "About You GmBH, Hamburg Germany",
            "role_1": "Started as intermediate developer focusing on React Native.",
            "role_2": "Went on to become a <strong>Lead Developer</strong> focusing on Mobile Web Shop. Worked on several hot topics inside the company focusing on managerial, analytical and techinical side of things",
            "achievement_1": "Google Optimize Integration - A project to improve AB testing capabilities",
            "achievement_2": "Graph QL POC - Proof of concept to bring GraphQL architecture.",
            "achievement_3": "GRPC Web integration",
            "achievement_4": "Analytics integration with Optimizely to further improve the AB Testing setup"
        },
        "razorthink": {
            "company_name": "Razorthink, Bangalore India",
            "role_1": "As a key member of the front end team, I assisted Razorthink in developing their customer-facing application using <strong>React, Redux, and redux-saga.</strong>",
            "role_2": "I helped with setting up the Git workflow for releases as well as the development environment.",
            "role_3": "I looked into every option for a solution to a problem. I monitored the possible hazards and enhancements in the codebase and assisted in overcoming them.",
            "achievement_1": "Used a 🤓 smart rendering approach to render tabular data containing <strong>1000 rows</strong> using <strong>React virtualized list</strong>",
            "achievement_2": "<strong>Jupyter notebook</strong> integration with semantic errors and syntax highlighting",
            "achievement_3": "Lazy loading of dependencies such as Reducers, Redux Sags and Modules"
        },
        "cmango": {
            "company_name": "Cartoon Mango Studios, Bangalore India",
            "role_1": "I was able to work on projects autonomously while concentrating on the needs of the client despite being a junior developer.",
            "role_2": "Developed Complex web applications that involved working with HTML Canvas and SVG",
            "role_3": "Worked on a project named Caselets that was self-managed. I collaborated with the founder and assisted him in setting up the project's entirety using Firebase and React.",
            "achievement_1": "I began my React JS Journey",
            "achievement_2": "Gained more passion towards front end development",
            "achievement_3": "I gained knowledge regarding scalable systems used by millions of daily users while consulting for cleartip.com."
        }
    }
}